// 1 汉字：^[\u4e00-\u9fa5]{0,}$ 
//英文 ^[A-Za-z]+$ 
// 符号：. _ - 空格

// 4种情况 
//1. 全汉字
//2. 汉字和字符（不能有空格）
// let reg1 = /^[\u4e00-\u9fa5][[._-]?][\u4e00-\u9fa5]$//
//3. 全英文
//4. 英文和字符
// let reg2 = /[A-Za-z][\s][A-Za-z]/


// 要求：
/**
 * 汉字之间不能有空格
 * 英文名字母中间只允许有一个空格
 * 汉字与符号之间，字母与符号之间不允许有空格
 * ._-只能出现在两个汉字或者字母之间，两个汉字或字母之间只能有1个符号
 */
// function validate(value){

// }

// let reg = /^[\u4e00-\u9fa5a-zA-Z]+$|^([\u4e00-\u9fa5]+(●|_|-){0,1}[\u4e00-\u9fa5])+$|^([a-zA-Z]+(●|_|-|\s){0,1}[a-zA-Z])+$/
let reg = /^[\u4e00-\u9fa5a-zA-Z]+$|^([\u4e00-\u9fa5]+(●|_|-){0,1}[\u4e00-\u9fa5])+$|^([a-zA-Z]+(●|_|-|\s){0,1}[a-zA-Z])+$/
/**
 * ^[\u4e00-\u9fa5a-zA-Z]+$
 * ^([\u4e00-\u9fa5]+(●|_|-){0,1}[\u4e00-\u9fa5])+$
 * ^([a-zA-Z]+(●|_|-|\s){0,1}[a-zA-Z])+$
 */
/**
 * ^[\u4e00-\u9fa5]+$ 纯中文
 * ^[a-zA-Z]+$ 纯英文
 */
let reg1 = /^[\u4e00-\u9fa5]+$|^[a-zA-Z]+$|/